<a href="https://colab.research.google.com/github/Vinoth1512/ML-ASSIGNMENTS/blob/main/ASSIGNMENT_4_LabelEncoder.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import sklearn

In [ ]:
data=pd.read_csv("https://data.princeton.edu/wws509/datasets/salary.dat",delim_whitespace=True)

In [ ]:
df=pd.DataFrame(data)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [ ]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [ ]:
df['sx']=le.fit_transform(df.sx)
df['rk']=le.fit_transform(df.rk)
df['dg']=le.fit_transform(df.dg)

In [ ]:
df.head()

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696